MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN128VFM5/mcu.h
#define Synchronous Mode              0x180000000      // Configures between asynchronous and synchronous modes of operation. When configured for a synchronous mode of operation, the transmitter must be configured for asynchronous operation.
#define Bit Clock Swap                0x20000000      // When the SAI is in asynchronous mode and this field is set to 1, the receiver is clocked by the transmitter bit clock. When the SAI is in synchronous mode and this field is set to 1, the receiver is clocked by the receiver bit clock, but it uses the transmitter frame sync.
#define Bit Clock Input               0x10000000      // When set in either asynchronous or synchronous mode and the module is using an internally generated bit clock, configures the internal logic to be clocked as if the bit clock was externally generated. This has the effect of decreasing data input setup time, but increasing data output valid time. This bit has no effect when configured for an externally generated bit clock.
#define MCLK Select                   0x18000000      // Selects the audio master clock used to generate an internally generated bit clock. This field has no effect when configured for an externally generated bit clock.
#define Bit Clock Polarity            0x02000000      // Configures the polarity of the bit clock.
#define Bit Clock Direction           0x01000000      // Configures the direction of the bit clock.
#define Bit Clock Divide              0x00007F80      // Divides down the audio master clock to generate the bit clock when configured for an internal bit clock. The division value is (DIV + 1) * 2.


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RCR3 register.
//
//*****************************************************************************

#define Receive Channel Enable        0x00010000      // Enables a data channel for a receive operation. A channel should be enabled before its FIFO is accessed.
#define Word flag configuration       0x00000078      // Configures which word the start of word flag is set. The value written should be one less than the word number (for example, write zero to configure for the first word in the frame). When configured to a value greater than the Frame Size field, then the start of word flag is never set.


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RCR4 register.
//
//*****************************************************************************

#define Frame Size                    0x00780000      // Configures the number of words in each frame. The value written must be one less than the number of words in the frame. For example, write 0 for one word per frame. The maximum supported frame size is 16 words.
#define Sync Width                    0x0001F000      // Configures the length of the frame sync in number of bit clocks. The value written must be one less than the number of bit clocks. For example, write 0 for the frame sync to assert for one bit clock only. The sync width cannot be configured longer than the first word of the frame.
#define MSB First                     0x00000010      // Specifies whether the LSB or the MSB is transmitted/received first.
#define Frame Sync Early              0x00000008      // 
#define Frame Sync Polarity           0x00000002      // Configures the polarity of the frame sync.
#define Frame Sync Direction          0x00000001      // Configures the direction of the frame sync.


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RCR5 register.
//
//*****************************************************************************

#define Word N Width                  0x1F0000000      // Configures the number of bits in each word, for each word except the first in the frame. The value written must be one less than the number of bits per word. The value of WNW must be greater than or equal to the value of W0W even when there is only one word in each frame. Word width of less than 8 bits is not supported.
#define Word 0 Width                  0x01F00000      // Configures the number of bits in the first word in each frame. The value written must be one less than the number of bits in the first word. Word width of less than 8 bits is not supported if there is only one word per frame.
#define First Bit Shifted             0x0001F000      // Configures the bit index for the first bit received for each word in the frame. If configured for MSB First, the index of the next bit received is one less than the current bit received. If configured for LSB First, the index of the next bit received is one more than the current bit received. The value written must be greater than or equal to the word width when configured for MSB First. The value written must be less than or equal to 31-word width when configured for LSB First.


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RDRn register.
//
//*****************************************************************************

#define Receive Data Register         0x7FFFFFFF80000000      // The corresponding RCR3[RCE] bit must be set before accessing the channel's receive data register. Reads from this register when the receive FIFO is not empty will return the data from the top of the receive FIFO. Reads from this register when the receive FIFO is empty are ignored.
#define RDR[31:0]                     0x7FFFFFFF80000000      // Receive Data Register


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RFRn register.
//
//*****************************************************************************

#define Write FIFO Pointer            0x001C0000      // FIFO write pointer for receive data channel.
#define Read FIFO Pointer             0x0000001C      // FIFO read pointer for receive data channel.
#define WFP                           0x001C0000      // FIFO write pointer for receive data channel
#define RFP                           0x0000001C      // FIFO read pointer for receive data channel


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RMR register.
//
//*****************************************************************************

#define Receive Word Mask             0x7FFF8000      // For each word in the frame, configures whether the receive word is masked.
#define RWM                           0x7FFF8000      // Receive Word Mask


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_MCR register.
//
//*****************************************************************************

#define Divider Update Flag           0x80000000      // Provides the status of on-the-fly updates to the MCLK divider ratio.
#define MCLK Output Enable            0x40000000      // Enables the MCLK divider and configures the MCLK signal pin as an output. When software clears this field, it remains set until the MCLK divider is fully disabled.
#define MCLK Input Clock Select       0x06000000      // Selects the clock input to the MCLK divider. This field cannot be changed while the MCLK divider is enabled. See the chip configuration details for information about the connections to these inputs.
#define DUF                           0x80000000      // Divider Update Flag
#define MOE                           0x40000000      // MCLK Output Enable
#define MICS                          0x06000000      // MCLK Input Clock Select


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_MDR register.
//
//*****************************************************************************

#define MCLK Fraction                 0x07F80000      // Sets the MCLK divide ratio such that: MCLK output = MCLK input * ( (FRACT + 1) / (DIVIDE + 1) ). FRACT must be set equal or less than the value in the DIVIDE field.
#define MCLK Divide                   0x007FF800      // Sets the MCLK divide ratio such that: MCLK output = MCLK input * ( (FRACT + 1) / (DIVIDE + 1) ). FRACT must be set equal or less than the value in the DIVIDE field. ::
#define FRACT                         0x07F80000      // MCLK Fraction
#define DIVIDE                        0x007FF800      // MCLK Divide


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PDOR register.
//
//*****************************************************************************

#define PDO                           0x7FFFFFFF80000000      // Port Data Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PSOR register.
//
//*****************************************************************************

#define PTSO                          0x7FFFFFFF80000000      // Port Set Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PCOR register.
//
//*****************************************************************************

